OpenNuvoton/NUC980_SDWriter/SampleCode/SD_Writer/main.c
DIR dir;                /* Directory object */
UINT s1, s2, s3, s4, cnt;
FRESULT result;
char *ptr;
FATFS   *fs;              /* Pointer to file system object */
TCHAR   sd_path[] = { '0', ':', 0 };    /* SD drive started from 0 */
FILINFO Finfo;
long    p1, p2, p3;
static FIL file1, file2;        /* File objects */

BYTE DDR_Line[80][23];
UINT32 DDRInitAddr[80];
UINT32 DDRInitData[80];
UINT32 DDRInitCount = 0;


static BYTE my_atoi(char src)
{
    BYTE c = 0;
    if ((src >= '0') && (src <= '9'))
        c = src - '0';
    else if ((src >= 'a') && (src <= 'f'))
        c = 0xa + src - 'a';
    else if ((src >= 'A') && (src <= 'F'))
        c = 0xA + src - 'A';
    return (c);
}

static void _parsing_DDRInit(int FileLen)
{
    int src_c = 0;
    int dest_c = 0;
    int LineNo = 0;
    int IsAddr = 1;

    DDRInitCount = 0;

    while (src_c < FileLen) {
        //sysprintf("[%d][%x][%x]\n",src_c,Buff[src_c], Buff[src_c+1]);
        if ((Buff[src_c] == 0x30) && (Buff[src_c+1] == 0x78)) {//skip 0x
            src_c += 2;
            continue;
        }
        if ((Buff[src_c] == 0xD) && (Buff[src_c+1] == 0xA)) {//Line end
            if ((Buff[src_c+2] == 0x30) && (Buff[src_c+3] == 0x78)) {
                src_c += 2;
                LineNo++;
                dest_c = 0;
                IsAddr ^= 1;
                DDRInitCount++;
                continue;
            }
        }

        if (Buff[src_c] == 0x3D) { //"="
            src_c++;
            IsAddr ^= 1;
            continue;
        }

        if (IsAddr)
            DDRInitAddr[LineNo] = DDRInitAddr[LineNo] * 16 + my_atoi(Buff[src_c]);
        else
            DDRInitData[LineNo] = DDRInitData[LineNo] * 16 + my_atoi(Buff[src_c]);

        DDR_Line[LineNo][dest_c] = Buff[src_c];
        //sysprintf("c=[%d],Buff[c]=[%x],LineNo=%d,Line[%d][%d]=%x\n",src_c,Buff[src_c],LineNo,LineNo,dest_c,Line[LineNo][dest_c]);
        src_c++;
        dest_c++;
    }

    DDRInitCount += 1; //The last line

    printf("Total initail data count = %d\n",DDRInitCount);
}

static unsigned int CalculateCRC32(unsigned char * buf,unsigned int len)
{
    unsigned int i;
    unsigned int crc32;
    unsigned char* byteBuf;

    crc32 = 0 ^ 0xFFFFFFFF;
    byteBuf = (unsigned char *) buf;
    for (i=0; i < len; i++) {
        crc32 = (crc32 >> 8) ^ crc32_table[ (crc32 ^ byteBuf[i]) & 0xFF ];
    }
    return ( crc32 ^ 0xFFFFFFFF );
}

static void _parsing_EnvTxt(int FileLen, char *pEnv)
{
    int src_c =0;
    int dest_c = 4; /* The first four bytes are checksum */

    while (src_c < FileLen) {
        if (Buff[src_c] == 0) //EOF
            break;

        if ((Buff[src_c] == 0xD) && (Buff[src_c+1] == 0xA)) {//Line end
            pEnv[dest_c] = 0;
            src_c += 2;
            dest_c++;
        } else {
            pEnv[dest_c] = Buff[src_c];
            src_c++;
            dest_c++;
        }
    }

    *(unsigned int *)pEnv = CalculateCRC32((unsigned char *)(pEnv + 4), 0x10000 - 4);

    if (0) {
        int k;
        printf("ENV:\n");
        for (k=0; k<0x10000; k++) {
            printf("0x%x ",pEnv[k]);
            if (k && ((k+1)%16 == 0))
                printf("\n");
        }
        printf("\n");
    }

}

static void _parsing_SPINAND_EnvTxt(int FileLen, char *pEnv)
{
    int src_c =0;
    int dest_c = 4; /* The first four bytes are checksum */

    while (src_c < FileLen) {
        if (Buff[src_c] == 0) //EOF
            break;

        if ((Buff[src_c] == 0xD) && (Buff[src_c+1] == 0xA)) {//Line end
            pEnv[dest_c] = 0;
            src_c += 2;
            dest_c++;
        } else {
            pEnv[dest_c] = Buff[src_c];
            src_c++;
            dest_c++;
        }
    }

    *(unsigned int *)pEnv = CalculateCRC32((unsigned char *)(pEnv + 4), 0x20000 - 4);

    if (0) {
        int k;
        printf("ENV:\n");
        for (k=0; k<0x20000; k++) {
            printf("0x%x ",pEnv[k]);
            if (k && ((k+1)%16 == 0))
                printf("\n");
        }
        printf("\n");
    }

}

static void Form_BootCode_Header(unsigned int *header_size)
{
    FRESULT res;
    int i;

    memset((void*)Buff, 0xFF, BUFF_SIZE);
    printf("open DDR ini file [%s]\n", Ini_Writer.DDR.FileName);
    res = f_open(&file1, Ini_Writer.DDR.FileName, FA_OPEN_EXISTING | FA_READ);
    if (res)
        printf("res = %d\n",res);
    else
        printf("f_open [%s] ok\n", Ini_Writer.DDR.FileName);

    printf("read DDR ini file [%s]\n", Ini_Writer.DDR.FileName);
    res = f_read(&file1, Buff, BUFF_SIZE, &s1);
    if (res || s1 == 0) {
        printf("res = %d,read size = %d\n",res,s1);
        printf("Error while read file\n");
        while(1) {   /* error or eof */
            WDT_RSTCNT;
        }
    }

    _parsing_DDRInit(s1);

    //Form boot code header
    *(unsigned int*)(Buff + 0) = 0x4E565420; //Boot code marker
    *(unsigned int*)(Buff + 4) = Ini_Writer.Loader.address; //2nd word - Execution address
    *(unsigned int*)(Buff + 8) = Ini_Writer.Loader_size;  //3rd word - Image size
    *(unsigned int*)(Buff + 12) = 0xFFFFFFFF;

    if (Ini_Writer.UserDef_SPI.PageSizeDefined)
        *(unsigned int*)(Buff + 16) = ((Ini_Writer.UserDef_SPI.SpareArea) << 16)|(Ini_Writer.UserDef_SPI.PageSize);//0x00400800;
    else
        *(unsigned int*)(Buff + 16) = (info.SPINand_SpareArea << 16)|(info.SPINand_PageSize);//0x00400800;

    if (Ini_Writer.UserDef_SPI.QuadCmdDefined) {
        *(unsigned int*)(Buff + 20) = ((Ini_Writer.UserDef_SPI.QuadReadCmd)
                                       |(Ini_Writer.UserDef_SPI.ReadStatusCmd << 8)
                                       |(Ini_Writer.UserDef_SPI.WriteStatusCmd << 16)
                                       |(Ini_Writer.UserDef_SPI.StatusValue << 24)); //0x023135EB
        *(unsigned int*)(Buff + 24) = (Ini_Writer.UserDef_SPI.DummyByte) | 0xFFFFFF00;
    } else {
        *(unsigned int*)(Buff + 20) = ((info.SPINand_QuadReadCmd)
                                       |(info.SPINand_ReadStatusCmd << 8)
                                       |(info.SPINand_WriteStatusCmd << 16)
                                       |(info.SPINand_StatusValue << 24)); //0x023135EB
        *(unsigned int*)(Buff + 24) = (info.SPINand_dummybyte) | 0xFFFFFF00;
    }
    *(unsigned int*)(Buff + 28) = 0xFFFFFFFF;

    *(unsigned int*)(Buff + 32) = 0xAA55AA55;
    *(unsigned int*)(Buff + 32 + 4) = DDRInitCount;

