OpenNuvoton/NUC980_SDWriter/SampleCode/SD_Writer/main.c
    printf("Copy DDR init data to Buff\n");
    for (i=0; i<DDRInitCount; i++) {
        *(unsigned int*)(Buff + 32 + 8 + (8*i)) = DDRInitAddr[i];
        *(unsigned int*)(Buff + 32 + 8 + (8*i) + 4) = DDRInitData[i];
    }

    //U-Boot should be put in 16 byte align
    if ((DDRInitCount%2) == 0) {
        for (i=0; i<8; i++)
            Buff[32 + 8 + DDRInitCount*8 + i] = 0xff; //Set dumy byte to 0xff
    }

    if (DDRInitCount%2)
        *header_size = 32 + 8 + (DDRInitCount*8);
    else {
        *header_size = 32 + 8 + (DDRInitCount*8) + 8;
    }

    f_close(&file1);
}

int32_t main(void)
{
    char        *ptr, *ptr2;
    long        p1, p2, p3;
    BYTE        *buf;
    FATFS       *fs;              /* Pointer to file system object */
    TCHAR       sd_path[] = { '0', ':', 0 };    /* SD drive started from 0 */
    FRESULT     res;

    DIR dir;                /* Directory object */
    UINT s1, s2, cnt;
    DWORD ofs = 0, sect = 0;
    UINT ImgNo,ImageCnt;

    *(volatile unsigned int *)(CLK_BA+0x18) |= (1<<16); /* Enable UART0 */
    UART_Init();
    printf("\n");
    printf("===============================================\n");
    printf("          SD Writer                            \n");
    printf("===============================================\n");

    sysDisableCache();
    sysFlushCache(I_D_CACHE);
    sysEnableCache(CACHE_WRITE_BACK);

    Buff = (BYTE *)((UINT32)&Buff_Pool[0] | 0x80000000);   /* use non-cache buffer */
    Block_Buff = (BYTE *)((UINT32)&Block_Buff_Pool[0] | 0x80000000);   /* use non-cache buffer */

    SYS_Init();
    WDT_RSTCNT;
    outpw(REG_WDT_CTL, (inpw(REG_WDT_CTL) & ~(0xf << 8))|(0x8<<8));// timeout 2^20 * (12M/512) = 44 sec

    ETimer1_Init();
    fmiHWInit();

    if (((inpw(REG_SYS_PWRON) & 0x00000300) == 0x300)) {
        /* Use SD0 */
        printf("Reading SD card in SD port 0 .....\n\n");
        sd_path[0] = '0';
        sysInstallISR(IRQ_LEVEL_1, IRQ_FMI, (PVOID)SDH0_IRQHandler);
        /* enable CPSR I bit */
        sysSetLocalInterrupt(ENABLE_IRQ);
        sysEnableInterrupt(IRQ_FMI);

        SDH_Open_Disk(SDH0, CardDetect_From_GPIO);
        f_chdrive(sd_path);          /* set default path */
        SDH_CardDetection(SDH0);
    } else {
        /* Use SD1 */
        printf("Reading SD card in SD port 1 .....\n\n");
        sd_path[0] = '1';
        sysInstallISR(IRQ_LEVEL_1, IRQ_SDH, (PVOID)SDH_IRQHandler);
        /* enable CPSR I bit */
        sysSetLocalInterrupt(ENABLE_IRQ);
        sysEnableInterrupt(IRQ_SDH);

        SDH_Open_Disk(SDH1, CardDetect_From_GPIO);
        f_chdrive(sd_path);          /* set default path */
        SDH_CardDetection(SDH1);
    }

    while (*ptr == ' ') ptr++;
    res = f_opendir(&dir, ptr);
    if (res) {
        put_rc(res);
        printf("res = %d\n",res);
    }
    p1 = s1 = s2 = 0;
    for(;;) {
        WDT_RSTCNT;
        res = f_readdir(&dir, &Finfo);
        if ((res != FR_OK) || !Finfo.fname[0]) break;
        if (Finfo.fattrib & AM_DIR) {
            s2++;
        } else {
            s1++;
            p1 += Finfo.fsize;
        }
        printf("%c%c%c%c%c %d/%02d/%02d %02d:%02d    %9d  %s",
               (Finfo.fattrib & AM_DIR) ? 'D' : '-',
               (Finfo.fattrib & AM_RDO) ? 'R' : '-',
               (Finfo.fattrib & AM_HID) ? 'H' : '-',
               (Finfo.fattrib & AM_SYS) ? 'S' : '-',
               (Finfo.fattrib & AM_ARC) ? 'A' : '-',
               (Finfo.fdate >> 9) + 1980, (Finfo.fdate >> 5) & 15, Finfo.fdate & 31,
               (Finfo.ftime >> 11), (Finfo.ftime >> 5) & 63, (unsigned int)Finfo.fsize, Finfo.fname);
#if _USE_LFN
        for (p2 = strlen(Finfo.fname); p2 < 14; p2++)
            printf(" ");
        printf("%s\n", Lfname);
#else
        printf("\n");
#endif
        if (Finfo.fattrib & AM_DIR) {

        }
    }
    printf("%4d File(s),%10d bytes total\n%4d Dir(s)", s1, (int)p1, s2);
    if (f_getfree(ptr, (DWORD*)&p1, &fs) == FR_OK)
        printf(", %10d bytes free\n", (int)p1 * fs->csize * 512);



    printf("Opening \"%s\"", "config");
    res = f_open(&file1, "config", FA_OPEN_EXISTING | FA_READ);
    printf("\n");
    if (res) {
        put_rc(res);
        printf("[config] res = %d\n",res);
    }

    p1 = 0;
    for (;;) {
        WDT_RSTCNT;
        res = f_read(&file1, Buff, BUFF_SIZE, &s1);
        if (res || s1 == 0) break;   /* error or eof */
        printf("Buff = %s\n",Buff);
    }
    f_close(&file1);

    ProcessINI("config");
    //ProcessINI("SPI_NAND/SPI_NAND.cfg");

    WDT_RSTCNT;
    res = f_opendir(&dir, ptr);
    if (res) {
        put_rc(res);
        printf("res = %d\n",res);
    }
    ImageCnt = 0;
    for(;;) {
        int n,i;
        res = f_readdir(&dir, &Finfo);
        if ((res != FR_OK) || !Finfo.fname[0]) break;
        if (!(n = strcasecmp((const char*)Finfo.fname, (const char*)Ini_Writer.Loader.FileName))) {
            printf("Ini_Writer.Loader.FileName = [%s], Finfo.fname = [%s]\n",Ini_Writer.Loader.FileName,Finfo.fname);
            printf("Loader [%s] file size is %d\n",Finfo.fname, (unsigned int)Finfo.fsize);
            Ini_Writer.Loader_size = Finfo.fsize;
        }
        for (i = 0; i < MAX_USER_IMAGE; i++) {
            if (!(n = strcasecmp((const char*)Finfo.fname, (const char*)Ini_Writer.UserImage[i].FileName))) {
                printf("Ini_Writer.UserImage[%d].FileName = [%s], Finfo.fname = [%s]\n",i,Ini_Writer.UserImage[i].FileName,Finfo.fname);
                printf("Data%d [%s] file size is %d\n",i,Finfo.fname, (unsigned int)Finfo.fsize);
                Ini_Writer.UserImage[i].DataSize = Finfo.fsize;
                ImageCnt++;
            }
        }
    }

    if (Ini_Writer.Type == TYPE_SPI_NOR) {
        printf("Write Type is SPI NOR flash\n");

        if (0) { //Chip erase
            printf("Chip erase...\n");
            spiInit();
            spiEraseAll();
            spiCheckBusy();
            printf("Chip erase... done\n");
        }

        spiInit();
        if (Ini_Writer.Loader.user_choice == 1) {
            int i, offset=0, blockCount, len;
            unsigned int header_size;

