OpenNuvoton/NUC980_SDWriter/SampleCode/SD_Writer/main.c
            WDT_RSTCNT;
            printf("open [%s]\n", Ini_Writer.Loader.FileName);
            res = f_open(&file2, Ini_Writer.Loader.FileName, FA_OPEN_EXISTING | FA_READ);
            if (res)
                printf("result = %d\n",res);
            else
                printf("f_open [%s] ok\n", Ini_Writer.Loader.FileName);

            //Burn Loader to SPI flash
            printf("Write [%s] to SPI flash ... start\n",Ini_Writer.Loader.FileName);

            //Write the first block
            Form_BootCode_Header(&header_size);

            res = f_read(&file2, Buff + header_size, SPI_BLOCK_SIZE - header_size, &s2);
            if (res || s2 == 0) {
                printf("res = %d,read size = %d\n",res,s2);
                while(1) {   /* error or eof */
                    WDT_RSTCNT;
                }
            }
            printf("Burn_SPI  offset=0x%x(%d)\n", offset, offset);
            spiEraseSector(offset, 1);
            spiWrite(offset, SPI_BLOCK_SIZE, (UINT8 *)Buff);
            offset += SPI_BLOCK_SIZE;

            len = Ini_Writer.Loader_size - (SPI_BLOCK_SIZE - header_size);
            if (len > 0) {
                //Write following blocks
                blockCount = len / SPI_BLOCK_SIZE;
                printf("Burn_SPI: offset=0x%x  len=%d   blockCount= %d\n", offset, len, blockCount);

                for (i=0; i<blockCount; i++) {
                    WDT_RSTCNT;
                    printf("Burn_SPI  offset=0x%x(%d)\n", offset, offset);
                    Enable4ByteFlag = 0;
                    // 4Byte Address Mode (>16MByte)
                    if((offset + SPI_BLOCK_SIZE) > SPI_FLASH_SIZE)
                        Enable4ByteFlag = 1;
                    if(len > SPI_FLASH_SIZE)
                        Enable4ByteFlag = 1;

                    if(Enable4ByteFlag)
                        printf("Enable4ByteFlag %d:  offset=0x%08x(%d)\n", Enable4ByteFlag, offset, offset);

                    res = f_read(&file2, Buff, SPI_BLOCK_SIZE, &s2);
                    if (res || s2 == 0) {
                        printf("res = %d,read size = %d\n",res,s2);
                        while(1) {   /* error or eof */
                            WDT_RSTCNT;
                        }
                    }
                    ETimer1_cnt = 0;
                    ETIMER_Start(1);
                    spiEraseSector(offset, 1);
                    spiWrite(offset, SPI_BLOCK_SIZE, (UINT8 *)Buff);
                    ETIMER_Stop(1);
                    WDT_RSTCNT;

                    offset += SPI_BLOCK_SIZE;

                    //ack status
                    //tmplen += SPI_BLOCK_SIZE;
                    //SendAck((tmplen * 95) / len);
                }
                if ((len % (SPI_BLOCK_SIZE)) != 0) {
                    printf("Burn_SPI  offset=0x%x(%d)\n", offset, offset);
                    // 4Byte Address Mode (>16MByte)
                    Enable4ByteFlag = 0;
                    if((offset + SPI_BLOCK_SIZE) > SPI_FLASH_SIZE)
                        Enable4ByteFlag = 1;
                    if(offset > SPI_FLASH_SIZE)
                        Enable4ByteFlag = 1;

                    if(Enable4ByteFlag)
                        printf("Enable4ByteFlag %d:  offset=0x%08x(%d)\n", Enable4ByteFlag, offset, offset);

                    len = len - blockCount*SPI_BLOCK_SIZE;
                    res = f_read(&file2, Buff, len, &s2);
                    if (res || s2 == 0) {
                        printf("res = %d,read size = %d\n",res,s2);
                        while(1) {   /* error or eof */
                            WDT_RSTCNT;
                        }
                    }
                    ETimer1_cnt = 0;
                    ETIMER_Start(1);
                    spiEraseSector(offset, 1);
                    spiWrite(offset, len, (UINT8 *)Buff);
                    ETIMER_Stop(1);
                }
            }
            f_close(&file2);
            printf("Write [%s] to SPI flash ... done\n",Ini_Writer.Loader.FileName);
        }

        if (Ini_Writer.UserImage[0].user_choice == 1) {
            for (ImgNo = 0; ImgNo < ImageCnt; ImgNo++) {
                WDT_RSTCNT;
                printf("open [%s]\n", Ini_Writer.UserImage[ImgNo].FileName);
                res = f_open(&file2, Ini_Writer.UserImage[ImgNo].FileName, FA_OPEN_EXISTING | FA_READ);
                if (res)
                    printf("result = %d\n",res);
                else
                    printf("f_open [%s] ok\n", Ini_Writer.UserImage[ImgNo].FileName);

                //Burn to SPI flash
                spiInit();
                printf("Write [%s] to SPI flash offset [0x%x] ... start\n", Ini_Writer.UserImage[ImgNo].FileName,Ini_Writer.UserImage[ImgNo].address);
                if (1) {
                    int i, offset=0, blockCount;
                    unsigned int len;
                    len = Ini_Writer.UserImage[ImgNo].DataSize;
                    blockCount = len / SPI_BLOCK_SIZE;
                    offset = Ini_Writer.UserImage[ImgNo].address;
                    printf("Burn_SPI: offset=0x%x  len=%d   blockCount= %d\n", offset, Ini_Writer.UserImage[ImgNo].DataSize, blockCount);

                    for (i=0; i<blockCount; i++) {
                        WDT_RSTCNT;
                        printf("Burn_SPI  offset=0x%x(%d)\n", offset, offset);
                        Enable4ByteFlag = 0;
                        // 4Byte Address Mode (>16MByte)
                        if((offset + SPI_BLOCK_SIZE) > SPI_FLASH_SIZE)
                            Enable4ByteFlag = 1;
                        if(Ini_Writer.UserImage[ImgNo].DataSize > SPI_FLASH_SIZE)
                            Enable4ByteFlag = 1;

                        if(Enable4ByteFlag)
                            printf("Enable4ByteFlag %d:  offset=0x%08x(%d)\n", Enable4ByteFlag, offset, offset);

                        res = f_read(&file2, Buff, SPI_BLOCK_SIZE, &s2);
                        if (res || s2 == 0) {
                            printf("res = %d,read size = %d\n",res,s2);
                            while(1) {   /* error or eof */
                                WDT_RSTCNT;
                            }
                        }

                        ETimer1_cnt = 0;
                        ETIMER_Start(1);
                        spiEraseSector(offset, 1);
                        spiWrite(offset, SPI_BLOCK_SIZE, (UINT8 *)Buff);
                        ETIMER_Stop(1);
                        WDT_RSTCNT;

                        offset += SPI_BLOCK_SIZE;

                        //ack status
                        //tmplen += SPI_BLOCK_SIZE;
                        //SendAck((tmplen * 95) / len);
                    }
                    if ((len % (SPI_BLOCK_SIZE)) != 0) {
                        WDT_RSTCNT;
                        printf("Burn_SPI  offset=0x%x(%d)\n", offset, offset);
                        // 4Byte Address Mode (>16MByte)
                        Enable4ByteFlag = 0;
                        if((offset + SPI_BLOCK_SIZE) > SPI_FLASH_SIZE)
                            Enable4ByteFlag = 1;
                        if(offset > SPI_FLASH_SIZE)
                            Enable4ByteFlag = 1;

