OpenNuvoton/NUC980_SDWriter/SampleCode/SD_Writer/main.c
            for (ImgNo = 0; ImgNo < ImageCnt; ImgNo++) {
                WDT_RSTCNT;
                printf("open [%s]\n", Ini_Writer.UserImage[ImgNo].FileName);
                res = f_open(&file2, Ini_Writer.UserImage[ImgNo].FileName, FA_OPEN_EXISTING | FA_READ);
                if (res)
                    printf("result = %d\n",res);
                else
                    printf("f_open [%s] ok\n", Ini_Writer.UserImage[ImgNo].FileName);


                //Burn to SPI NAND flash
                printf("Write [%s] to SPI NAND flash offset [0x%x] ... start\n", Ini_Writer.UserImage[ImgNo].FileName,Ini_Writer.UserImage[ImgNo].address);

                blk_count = Ini_Writer.UserImage[ImgNo].DataSize/(pSN->SPINand_PagePerBlock * pSN->SPINand_PageSize);
                printf("Img[%d] size = %d, blk_count = %d\n",ImgNo,Ini_Writer.UserImage[ImgNo].DataSize,blk_count);

                startblk = Ini_Writer.UserImage[ImgNo].address/((pSN->SPINand_PagePerBlock) * (pSN->SPINand_PageSize));
                endblk = startblk + (Ini_Writer.UserImage[ImgNo].DataSize/((pSN->SPINand_PagePerBlock)*(pSN->SPINand_PageSize)));
                printf("startblk = %d, endblk = %d\n",startblk,endblk);

                page_count = pSN->SPINand_PagePerBlock;

                // erase block
                for(blkindx = startblk; blkindx <= endblk; blkindx++) {
                    len = MIN(((pSN->SPINand_PagePerBlock)*(pSN->SPINand_PageSize)), Ini_Writer.UserImage[ImgNo].DataSize);
                    res = f_read(&file2, Buff, len, &s2);
                    //printf("len = %d, s2 = %d\n",len,s2);
                    if (res) {
                        printf("res = %d,read size = %d\n",res,s2);
                        while(1) {   /* error or eof */
                            WDT_RSTCNT;
                        }
                    }
_retry_spinand_2:
                    if (blkindx > pSN->SPINand_BlockPerFlash) {
                        printf("Write out of SPI NAND flash! blkindx[%d], BlockPerFlash = %d\n", blkindx, pSN->SPINand_BlockPerFlash);
                        while(1) {
                            WDT_RSTCNT;
                        }
                    }
                    WDT_RSTCNT;
                    page = pSN->SPINand_PagePerBlock * (blkindx);
                    addr = (unsigned int)Buff;
                    printf("blkindx = %d   page = %d   page_count=%d\n", blkindx, page, page_count);
                    if(spiNAND_bad_block_check(page) == 1) {
                        printf("bad block = %d\n", blkindx);
                        blkindx++;
                        endblk++;
                        goto _retry_spinand_2;
                    } else {
                        spiNAND_BlockErase(((page>>8)&0xFF), (page&0xFF)); // block erase
                        status = spiNAND_Check_Program_Erase_Fail_Flag();
                        if (status != 0) {
                            printf("Error erase status! spiNANDMarkBadBlock blockNum = %d\n", blkindx);
                            spiNANDMarkBadBlock(blkindx*pSN->SPINand_PagePerBlock);
                            blkindx++;
                            endblk++;
                            goto _retry_spinand_2;
                        }
                    }
                    // write block
                    for (i=0; i<pSN->SPINand_PagePerBlock; i++) {
                        //printf("page+i=%d\n",page+i);
                        WDT_RSTCNT;

                        ETimer1_cnt = 0;
                        ETIMER_Start(1);
                        spiNAND_Pageprogram_Pattern(0, 0, (uint8_t*)addr, pSN->SPINand_PageSize);
                        spiNAND_Program_Excute((((page+i)>>8)&0xFF), (page+i)&0xFF);
                        ETIMER_Stop(1);
                        WDT_RSTCNT;
                        status = (spiNAND_StatusRegister(3) & 0x0C)>>2;
                        if (status != 0) {
                            spiNANDMarkBadBlock(blkindx*pSN->SPINand_PagePerBlock);
                            printf("Error write status! Bad block[%d]!\n",blkindx);
                            blkindx++;
                            endblk++;
                            goto _retry_spinand_2;
                        }
                        addr += pSN->SPINand_PageSize;
                    }
                }
                f_close(&file2);
                printf("Write [%s] to SPI NAND flash ... done\n",Ini_Writer.UserImage[ImgNo].FileName);
            }
        }

        if (Ini_Writer.Env.user_choice == 1) {
            unsigned int i,blkindx,page,page_count;
            unsigned char status;
            unsigned int addr;

            WDT_RSTCNT;
            printf("open [%s]\n",Ini_Writer.Env.FileName);
            result = f_open(&file2, Ini_Writer.Env.FileName, FA_OPEN_EXISTING | FA_READ);
            if (result)
                printf("result = %d\n",result);
            else
                printf("f_open [%s] ok\n",Ini_Writer.Env.FileName);

            printf("read [%s]\n",Ini_Writer.Env.FileName);
            result = f_read(&file2, Buff, BUFF_SIZE, &s2);
            if (result || s2 == 0) {
                printf("result = %d,read size = %d\n",result,s2);
                //break;   /* error or eof */
            } else
                printf("[%s] size = %d\n",Ini_Writer.Env.FileName,s2);

            pENV = (char*)malloc(0x20000);
            if (!pENV) {
                printf("malloc fail [%s][%d]\n",__FUNCTION__,__LINE__);
                while(1) {
                    WDT_RSTCNT;
                }
            }
            memset((void*)pENV,0,0x20000);
            _parsing_SPINAND_EnvTxt(s2,pENV);
            f_close(&file2);

            //Burn to SPI NAND flash
            printf("Write Environment variable to SPI NAND flash offset [0x%x] ... start\n", Ini_Writer.Env.address);


            page_count = pSN->SPINand_PagePerBlock;
            blkindx=Ini_Writer.Env.address/(pSN->SPINand_PagePerBlock * pSN->SPINand_PageSize);

_retry_spinand_3:
            if (blkindx > pSN->SPINand_BlockPerFlash) {
                printf("Write out of SPI NAND flash! blkindx[%d], BlockPerFlash = %d\n", blkindx, pSN->SPINand_BlockPerFlash);
                while(1) {
                    WDT_RSTCNT;
                }
            }
            // erase block
            WDT_RSTCNT;
            addr = (unsigned int)pENV;
            page = pSN->SPINand_PagePerBlock * (blkindx);
            printf("blkindx = %d   page = %d   page_count=%d\n", blkindx, page, page_count);
            if(spiNAND_bad_block_check(page) == 1) {
                printf("bad block = %d\n", blkindx);
                blkindx++;
                goto _retry_spinand_3;
            } else {
                spiNAND_BlockErase(((page>>8)&0xFF), (page&0xFF)); // block erase
                status = spiNAND_Check_Program_Erase_Fail_Flag();
                if (status != 0) {
                    printf("Error erase status! spiNANDMarkBadBlock blockNum = %d\n", blkindx);
                    spiNANDMarkBadBlock(blkindx*pSN->SPINand_PagePerBlock);
                    blkindx++;
                    goto _retry_spinand_3;
                }
            }
            // write block
            for (i=0; i<page_count; i++) {
                //printf("page+i=%d\n",page+i);
                WDT_RSTCNT;
                ETimer1_cnt = 0;
                ETIMER_Start(1);
                spiNAND_Pageprogram_Pattern(0, 0, (uint8_t*)addr, pSN->SPINand_PageSize);
                spiNAND_Program_Excute((((page+i)>>8)&0xFF), (page+i)&0xFF);
                ETIMER_Stop(1);
                WDT_RSTCNT;
                status = (spiNAND_StatusRegister(3) & 0x0C)>>2;
                if (status != 0) {
                    spiNANDMarkBadBlock(blkindx*pSN->SPINand_PagePerBlock);
                    printf("Error write status! Bad block[%d]!\n",blkindx);
                    blkindx++;
                    goto _retry_spinand_3;
                }
                addr += pSN->SPINand_PageSize;
            }
            printf("Write Environment variable to SPI NAND flash ... done\n");
        }
    }
    if (Ini_Writer.Type == TYPE_NAND) {
        uint32_t chip_size;

        printf("Write Type is NAND flash\n");
        /* initial NAND */
        fmiNandInit();
        printf("g_uIsUserConfig=%d\n",g_uIsUserConfig);
        printf("UXmodem_NAND BlockPerFlash=%d\n",pSM->uBlockPerFlash);
        printf("UXmodem_NAND PagePerBlock=%d\n",pSM->uPagePerBlock);
        printf("UXmodem_NAND PageSize=%d\n",pSM->uPageSize);
        memset((char *)&nandImage, 0, sizeof(FW_NAND_IMAGE_T));
        pNandImage = (FW_NAND_IMAGE_T *)&nandImage;

        chip_size = (pSM->uBlockPerFlash)*(pSM->uPagePerBlock)*(pSM->uPageSize);
        printf("Chip size = 0x%x\n",chip_size);

        //printf("Chip erase...\n");
        //fmiSM_ChipErase(0);

        if (Ini_Writer.Loader.user_choice == 1) {
            unsigned int header_size;
            int blkindx,page,status,i,page_count,end_blk;

