OpenNuvoton/NUC980_SDWriter/SampleCode/SD_Writer/main.c
            //Burn Loader to NAND flash
            WDT_RSTCNT;
            printf("Write [%s] to NAND flash ... start\n",Ini_Writer.Loader.FileName);
            Form_BootCode_Header(&header_size);
            page_count = (Ini_Writer.Loader_size + header_size)/pSM->uPageSize;
            end_blk = 4;
            for(blkindx=0; blkindx<end_blk; blkindx++) {
                unsigned int len,addr;
                printf("open SPL [%s]\n", Ini_Writer.Loader.FileName);
                res = f_open(&file2, Ini_Writer.Loader.FileName, FA_OPEN_EXISTING | FA_READ);
                if (res)
                    printf("result = %d\n",res);
                else
                    printf("f_open SPL [%s] ok\n", Ini_Writer.Loader.FileName);

                len = MIN(((pSM->uPagePerBlock)*(pSM->uPageSize)), Ini_Writer.Loader_size);
                res = f_read(&file2, Buff + header_size, len, &s2);
                if (res) {
                    printf("res = %d,read size = %d\n",res,s2);
                    while(1) {   /* error or eof */
                        WDT_RSTCNT;
                    }
                }
_retry_1:
                if (blkindx > pSM->uBlockPerFlash) {
                    printf("Write out of NAND flash!\n");
                    while(1) {
                        WDT_RSTCNT;
                    }
                }
                page = pSM->uPagePerBlock * (blkindx);
                addr = (unsigned int)Buff;
                printf("Erase block [%d]\n",blkindx);
                status = fmiSM_BlockErase(pSM, blkindx);
                if (status != 0) {
                    fmiMarkBadBlock(pSM, blkindx);
                    printf("Bad block [%d]\n",blkindx);
                    blkindx++;
                    end_blk++;
                    goto _retry_1;
                }

                // write block
                for (i=0; i<page_count; i++) {
                    //printf("write page [%d]\n",page+i);
                    ETimer1_cnt = 0;
                    ETIMER_Start(1);
                    status = fmiSM_Write_large_page(page+i, 0, addr);
                    ETIMER_Stop(1);
                    if (status != 0) {
                        fmiMarkBadBlock(pSM, blkindx);
                        printf("Bad block [%d]\n",blkindx);
                        blkindx++;
                        end_blk++;
                        goto _retry_1;
                    }
                    addr += pSM->uPageSize;
                }
                //Write remaining data that is less than a page
                printf("write remaining [%d] byte to page[%d]\n",(Ini_Writer.Loader_size + header_size) % pSM->uPageSize,page_count);
                if ((Ini_Writer.Loader_size + header_size) % pSM->uPageSize) {
                    ETimer1_cnt = 0;
                    ETIMER_Start(1);
                    status = fmiSM_Write_large_page(page+page_count, 0, addr);
                    ETIMER_Stop(1);
                    if (status != 0) {
                        fmiMarkBadBlock(pSM, blkindx);
                        printf("Bad block [%d]\n",blkindx);
                        blkindx++;
                        end_blk++;
                        goto _retry_1;
                    }
                }
                f_close(&file2);
            }
            printf("Write [%s] to NAND flash ... done\n",Ini_Writer.Loader.FileName);
        }

        if (Ini_Writer.UserImage[0].user_choice == 1) {
            unsigned int addr;
            int blkindx,startblk,endblk,page,status,i;
            for (ImgNo = 0; ImgNo < ImageCnt; ImgNo++) {
                WDT_RSTCNT;
                printf("open [%s]\n", Ini_Writer.UserImage[ImgNo].FileName);
                res = f_open(&file2, Ini_Writer.UserImage[ImgNo].FileName, FA_OPEN_EXISTING | FA_READ);
                if (res)
                    printf("result = %d\n",res);
                else
                    printf("f_open [%s] ok\n", Ini_Writer.UserImage[ImgNo].FileName);

                //Burn to NAND flash
                printf("Write [%s] size [%d] to NAND flash offset [0x%x] ... start\n", Ini_Writer.UserImage[ImgNo].FileName, Ini_Writer.UserImage[ImgNo].DataSize, Ini_Writer.UserImage[ImgNo].address);

                startblk = Ini_Writer.UserImage[ImgNo].address/((pSM->uPagePerBlock)*(pSM->uPageSize));
                endblk = startblk + (Ini_Writer.UserImage[ImgNo].DataSize/((pSM->uPagePerBlock)*(pSM->uPageSize)));
                printf("startblk[%d], endblk[%d]\n",startblk,endblk);
                for(blkindx = startblk; blkindx <= endblk; blkindx++) {
                    unsigned int len;
                    WDT_RSTCNT;
                    len = MIN(((pSM->uPagePerBlock)*(pSM->uPageSize)), Ini_Writer.UserImage[ImgNo].DataSize);
                    res = f_read(&file2, Block_Buff, len, &s2);
                    if (res) {
                        printf("res = %d,read size = %d\n",res,s2);
                        while(1) {   /* error or eof */
                            WDT_RSTCNT;
                        }
                    }
_retry_2:

                    if (blkindx > pSM->uBlockPerFlash) {
                        printf("Write out of NAND flash!\n");
                        while(1) {
                            WDT_RSTCNT;
                        }
                    }
                    page = pSM->uPagePerBlock * (blkindx);
                    printf("Erase block [%d]\n",blkindx);
                    status = fmiSM_BlockErase(pSM, blkindx);
                    if (status != 0) {
                        fmiMarkBadBlock(pSM, blkindx);
                        printf("Bad block [%d]\n",blkindx);
                        blkindx++;
                        endblk++;
                        goto _retry_2;
                    }

                    // write block
                    // read BUFF_SIZE one time
                    page = blkindx*(pSM->uPagePerBlock);
                    addr = (unsigned int)Block_Buff;
                    for (i=0; i<pSM->uPagePerBlock; i++) {
                        //printf("write page[%d]\n",page+i);
                        ETimer1_cnt = 0;
                        ETIMER_Start(1);
                        status = fmiSM_Write_large_page(page+i, 0, addr);
                        ETIMER_Stop(1);
                        WDT_RSTCNT;
                        if (status != 0) {
                            fmiMarkBadBlock(pSM, blkindx);
                            printf("Bad block [%d]\n",blkindx);
                            blkindx++;
                            endblk++;
                            goto _retry_2;
                        }
                        addr += pSM->uPageSize;
                        //pagetmp++;
                    }
                }

                f_close(&file2);
                printf("Write [%s] to NAND flash ... done\n", Ini_Writer.UserImage[ImgNo].FileName);
            }
        }

        if (Ini_Writer.Env.user_choice == 1) {
            unsigned int addr;
            int blkindx,page,status,i,page_count;

