OpenNuvoton/NUC980_SDWriter/SampleCode/SD_Writer/main.c
                if (1) {
                    int i, offset=0, read_count, read_idx;
                    unsigned int len;
                    len = Ini_Writer.UserImage[ImgNo].DataSize;
                    read_count = len / EMMC_BLOCK_SIZE;
                    offset = Ini_Writer.UserImage[ImgNo].address;

                    for (read_idx = 0; read_idx < read_count; read_idx++) {
                        WDT_RSTCNT;
                        res = f_read(&file2, Buff, EMMC_BLOCK_SIZE, &s2);
                        if (res || s2 == 0) {
                            printf("res = %d,read size = %d\n",res,s2);
                            while(1) {   /* error or eof */
                                WDT_RSTCNT;
                            }
                        }
                        fmiSD_Write((offset/SD_SECTOR),(EMMC_BLOCK_SIZE)/SD_SECTOR,(UINT32)Buff);
                        offset += EMMC_BLOCK_SIZE;
                    }
                    if (len % EMMC_BLOCK_SIZE) {
                        WDT_RSTCNT;
                        res = f_read(&file2, Buff, len - (read_count*EMMC_BLOCK_SIZE), &s2);
                        if (res || s2 == 0) {
                            printf("res = %d,read size = %d\n",res,s2);
                            while(1) {   /* error or eof */
                                WDT_RSTCNT;
                            }
                        }
                        ETimer1_cnt = 0;
                        ETIMER_Start(1);
                        fmiSD_Write((offset/SD_SECTOR),(s2)/SD_SECTOR,(UINT32)Buff);
                        ETIMER_Stop(1);
                    }
                }
                printf("Write [%s] to eMMC ... done\n",Ini_Writer.UserImage[ImgNo].FileName);
                f_close(&file2);
            }
        }

        if (Ini_Writer.Env.user_choice == 1) {
            WDT_RSTCNT;
            printf("open [%s]\n",Ini_Writer.Env.FileName);
            result = f_open(&file2, Ini_Writer.Env.FileName, FA_OPEN_EXISTING | FA_READ);
            if (result)
                printf("result = %d\n",result);
            else
                printf("f_open [%s] ok\n",Ini_Writer.Env.FileName);

            printf("read [%s]\n",Ini_Writer.Env.FileName);
            result = f_read(&file2, Buff, EMMC_BLOCK_SIZE, &s2);
            if (result || s2 == 0) {
                printf("result = %d,read size = %d\n",result,s2);
                //break;   /* error or eof */
            } else
                printf("[%s] size = %d\n",Ini_Writer.Env.FileName,s2);

            pENV = (char*)malloc(0x10000);
            if (!pENV) {
                printf("malloc fail [%s][%d]\n",__FUNCTION__,__LINE__);
                while(1) {
                    WDT_RSTCNT;
                }
            }
            memset((void*)pENV,0,0x10000);
            _parsing_EnvTxt(s2,pENV);
            f_close(&file2);

            //Burn to eMMC
            printf("Write Environment variable to eMMC offset [%x] ... start\n", Ini_Writer.Env.address);
            ETimer1_cnt = 0;
            ETIMER_Start(1);
            fmiSD_Write((Ini_Writer.Env.address/SD_SECTOR),(0x10000/SD_SECTOR),(UINT32)pENV);
            ETIMER_Stop(1);
            printf("Write Environment variable to eMMC ... done\n");
        }
    }

    while(1) {
        WDT_RSTCNT;
    }
}
